In [1]:
import mysql.connector as conn

In [3]:
mydb = conn.connect(host = "localhost", user = "root", passwd = "mysql")

In [4]:
cursor = mydb.cursor()

In [6]:
cursor.execute('use student')

In [7]:
cursor.execute('SELECT * FROM person')
cursor.fetchall()

[(1, 'Ram Kumar', 19, 'M', '67843432', 'Agra'),
 (2, 'Shyam Kumar', 18, 'M', '63333432', 'Pune'),
 (3, 'Sita Kumari', 21, 'F', '633335432', 'Pune'),
 (4, 'Sita Ram', 23, 'M', '63332432', 'Agra'),
 (5, 'Mainsh Chaudhary', 26, 'M', '61112432', 'Agra'),
 (6, 'Sarita Chaudhary', 28, 'F', '61342432', 'Bhopal')]

In [8]:
cursor.execute('SELECT * FROM city')
cursor.fetchall()

[(1, 'Agra'), (2, 'Delhi'), (3, 'Bhopal'), (4, 'Jaipur'), (5, 'Noida')]

In [10]:
"""Q-15. Write an SQL query to fetch intersecting records of two tables."""

cursor.execute('SELECT id, name, city FROM person p LEFT JOIN city c ON p.city = c.cid')
cursor.fetchall()

[(1, 'Ram Kumar', 'Agra'),
 (2, 'Shyam Kumar', 'Pune'),
 (3, 'Sita Kumari', 'Pune'),
 (4, 'Sita Ram', 'Agra'),
 (5, 'Mainsh Chaudhary', 'Agra'),
 (6, 'Sarita Chaudhary', 'Bhopal')]

In [15]:
"""Q-16. Write an SQL query to show records from one table that another table does not
have."""

cursor.execute('SELECT id, p.name, p.city, c.cityname FROM person p RIGHT JOIN city c ON p.city = c.cid')
cursor.fetchall()

[(None, None, None, 'Agra'),
 (None, None, None, 'Delhi'),
 (None, None, None, 'Bhopal'),
 (None, None, None, 'Jaipur'),
 (None, None, None, 'Noida')]